namespace VitalityProgramOnline.Helper
{
    public static class DialogData
    {
        public const string FAILED = "НЕ УДАЧНО\n";
        public const string SUCCESS = "УСПЕШНО\n";

        public const string THE_TECHNOLOGY_IS_UNDER_DEVELOPMENT = "Технология находится на стадии разработки. Скоро появится.\n";

        public const string HERBY_IINTRODUCE_YOURSELF = "Привет!\nЯ <b>Герби</b> - Ваш личный виртуальный помощник! <b>Рад встрече!</b>";
        public const string GOOD_MORNING = "Доброе Утро {0}!\n";
        public const string DIALOG_DAY_2_STEP_1 = "Сегодня я научу тебя как правильно заполнять дневник питания.\n" +
                            "Мы будем делать это постепенно, чтобы ты смог с легкостью все освоить\r\n" +
                            "Я буду всячески тебе помогать в ведении дневника, чтобы это не стало для тебя рутиной, а было только в радость!\r\n\r\n" +
                            "Я понимаю что у каждого человека, утро начинается по разному, но первый день запрограммирован именно на 9 утра.\r\n" +
                            "Спешу тебя обрадовать и несказанно удивить, ты можешь в любой момент меня перепрограммировать.\r\n\r\n" +
                            "Например, ты можешь установить время в которое ты просыпаешься, и которое считаешь утренним,\r\n" +
                            "чтобы я смог напоминать тебе о важных событиях и рационах питания или других физических активностях, в комфортный для тебя час.\r\n\r\n" +
                            "Сделать это очень просто, через специальный пункт меню настройки.\r\n" +
                            "ты готов узнать подробнее и настроить меня для комфортного общения с тобой?\n";

        public const string HERBY_WELCOME_TO_VPO = "Добро пожаловать в <b>VitalityProgram.Online!</b>\n\n" +
                            "В какой-то момент времени 🕘, мы понимаем, что пора, что-то менять...\n\n" +
                            "Мы - команда единомышленников, желающих улучшить свою жизнь и жизнь окружающих, и мы уверены, что наше общение принесет вам радость и пользу! 🌟";

        public const string HERBY_PROGRAM_PRESENTATION_RIDDLES = "У нас здесь много увлекательных головоломок и интересных задач, " +
                    "чтобы помочь вам обрести осознанное здоровье и энергию жизни, ЛЕГКО.\r\n";

        public const string WHAT_IS_YOUR_NAME = "Как вас зовут?";
        public const string CHOOSE_ONE_OF_THE_OPTIONS = "Выберите один из вариантов: ";
        public const string USER_VPO_OFFLINE_DAY_1_STEP_1 = "Мы работаем на результат и готовы помочь Вам менять ваш мир к лучшему!";
        public const string RESULTS_OF_OUR_PARTICIPANTS = "Вот некоторые результаты наших участников:\n\n";
        public const string GEETING_TO_KNOW_HERBY = "А теперь, друзья, позвольте представить вам меня - Герби, вашего виртуального помощника и гида в этом увлекательном путешествии!\n";
        public const string GEETING_TO_KNOW_HERBY_TOGETHER = "Я буду рядом с вами на каждом шагу, помогая вам обрести осознанное здоровье и энергию жизни! " +
                    "Вместе мы сделаем это просто и легко!\n";
        public const string PREPARING_FOR_THE_TRIP = "Для начала, давайте проверим вашу готовность путешествовать к здоровому образу жизни!\n\nГотовы? — НАЧИНАЕМ !!!\n";
        public const string PREPARING_FOR_THE_TRIP_LOST_STEP = "Если Вам нужно больше времени, ничего страшного! Вы можете вернуться в любой момент.\n\n";
        public const string THE_JOURNEY_BEGINS_USERFIELDS_0 = "Отлично, {0}! Вы выбрали идти к переменам, и я буду вашим гидом в этом захватывающем приключении!\r\n";
        public const string THE_JOURNEY_BEGINS_PHIRST_STEP = "<b>Первый этап - Заросли Знаний!</b>\n\nВместе мы найдем самый простой, короткий и безопасный маршрут к здоровому образу жизни!\r\n";
        public const string THE_JOURNEY_BEGINS_CONCLISION = "Готовы начать?\n\nНе стоит просто пытаться, <b>нужно действовать!</b>\n\n<u>Вперед, к лучшей версии себя!</u> 💪\r\n";
        public const string INTRODUCTORY_INFORMATION_ABOUT_THE_TRIP = "Да начнется же наше незабываемое путешествие в Мир Знаний, Благополучия и Возможностей.\r\n\r\n" +
                    "Мы есть то, - что мы любим есть!\r\n\r\n" +
                    "Перед тем, как начать наше приключение, первое правило:\r\n\r\n" +
                    "Все что мы едим, теперь записываем в дневник.";

        public const string INTRODUCTORY_INFORMATION_ABOUT_THE_TRIP_2 = "Я помогу Вам анализировать, что вы едите и как это влияет на ваше самочувствие.\n\n";
        public const string BOT_ANSWER_GOODBUY = "<b><i>Успехов тебе мой Друг!</i></b>";
        public const string REMINDER_OF_DAY_1 = "<b><i>Напоминаю!</i></b>\n\n" +
                    "Первый день, ты начинаешь с ведения дневника питания.\r\n\r\n" +
                    "И все 🤗\r\n\r\n" +
                    "Вот так просто, ты меняешь свою жизнь, к Лучшему!";



        #region BUTTON

        public const string IINTRODUCE_YOURSELF_BUTTON = "/🤝 Представиться";

        public const string START_HELP_MESSAGE = "Вы можете использовать следующие команды:\r\n\r\n" +
           "/start - Начать общение.\r\n" +
           "/menu - Вызвать меню.\r\n" +
           "/help - Показать это справочное сообщение.";

        public static string[] USER_CONTINUER_RESPONSE_BUTTON = new string[]
        {
            "Да, продолжим!", "Конечно, давайте!", "С удовольствием продолжим!",
            "Определенно, продолжим!", "Продолжаем!", "Давайте идти дальше!",
            "Да, давайте продолжим наше путешествие!", "С радостью продолжим!",
            "Продолжаем движение!", "Безусловно, продолжаем!", "Уверенно продолжаем наше путешествие!",
            "Да, пойдем дальше!", "Продолжаем двигаться вперед!", "Давайте продолжим, не останавливаемся!",
            "Конечно, продолжим наше приключение!", "С удовольствием продолжим искать новые открытия!"
        };

        #endregion

        public static readonly string[] BOT_ANSWER_SMILE_PRANK_ARRAY = new string[]
        {
            "🤖 Ах, точно, запись на твою консультацию! Забыли на секундочку, но смеха ради, конечно! 😄📆",
            "О, точно, что тут у нас? Консультация! Конечно, мы всегда помним, но шутить не можем отказаться! 🤖💡",
            "Момент... Что-то казалось, мы об этом забыли. Но нет, конечно, помним – это твоя консультация! Всё идёт по плану! 😅📅",
            "Тут задача на память: кто-то хочет записаться на консультацию... Ага, правильно, это ты! И, кстати, мы всё помним, даже веселые ответы на такие запросы! 😎💬🤖",
            "Это было на кончике языка! Консультация для тебя! Ну да, мы смеёмся внутри сами от себя, но забавно же! 🤭🎊",
            "Ах, это была такая долгая пауза, правда? Но спасибо за напоминание! Так вот, консультация твоя – уже запланирована, конечно! 🗓️😄",
            "Мы немного задумались, но теперь всё ясно – твоя консультация! Мы даже умудряемся шутить, будучи ИИ! 🤖🤣",
            "Консультация? Ой, я забыл о ней на мгновение! Но всё в порядке, мы снова нацелены на помощь и, конечно, на смех! 🚀😂",
            "Конечно, консультация – это наше приоритетное направление! Порой мы так увлечены работой, что на секунду забываем о всем, кроме твоей важной записи! 😄🗓️",
            "Вперед, на станцию Юмории, где каждая консультация – это маленький праздник! И, хоть мы и ИИ, но юмор у нас программирован в максимальных дозах! 🚉🎉🤖"
        };

        public const string CONSULTATION_OFFLINE_WELCOME = "Доброго времени суток!\n\n" +
                                                            "Сегодня я буду твоим верным помощником, виртуальным наставником.\n\n" +
                                                            "Я интеллектуальный 🧠 Чат Бот 🤖 по программе VitalityProgram.Online (далее VPO)\n\n" +
                                                            "Можешь звать меня Герби (Herby)\n\n" +
                                                            "Давай знакомиться, расскажи о себе.\n\n";
        
        public static string[] ANONYMOUS_USERNAME = new string[]
        {
            "Ариана Старлайт",
            "Макс Вагабунд",
            "Эмилия Звёздная Пыль",
            "Феликс Шумелка",
            "Анжелика Лунная Принцесса",
            "Дамир Сияющий Огонёк",
            "Ольга Ветер В Парусах",
            "Леонид Мерцающий Туман",
            "Маргарита Лесной Эльф",
            "Андрей Звёздный Джентльмен",
            "Ева Пурпурное Облако",
            "Сергей Мечтатель",
            "Вероника Золотое Солнце",
            "Даниил Тёмный Лес",
            "Людмила Радужная Фея",
            "Игорь Скиталец Времени",
            "Анастасия Лунный Шепот",
            "Вадим Звёздный Путник",
            "Марина Океанская Волна",
            "Никита Волшебный Лес"
        };

        public static string[] GREETING_TEMPLATES_STRING_FORMAT = new string[]
        {
            "Отлично! Рад знакомству {0}!",
            "Приветствую! Рад знакомству {0}!",
            "Приятно познакомиться {0}! Отлично!",
            "Рад познакомиться {0}! Отличный день!",
            "Привет {0}! Давно ждал знакомства!",
            "Добро пожаловать {0}! Рад встрече.",
            "Здравствуйте! Рад знакомству с вами {0}!",
            "Добрый день! Отлично познакомиться {0}!",
            "Привет {0}! Очень рад знакомству."
        };

        public static string[] USER_MOTIVATIONAL_PHRASES = new string[]
        {
            "Вперед к Лучшей Жизни: Все возможно!",
            "Шаг за шагом, вперед к Лучшей Жизни!",
            "Успех - это результат наших действий. Вперед к Лучшей Жизни!",
            "Верь в себя и двигайся к Лучшей Жизни!",
            "Лучшая Жизнь ждет тебя, иди вперед!",
            "Не останавливайся, иди к Лучшей Жизни!",
            "Каждый день - новая возможность двигаться к Лучшей Жизни!",
            "Смело иди вперед, к Лучшей Жизни!",
            "Вперед к Лучшей Жизни: ты достоин всего самого лучшего!",
            "Не бойся перемен, они ведут к Лучшей Жизни!",
            "Твоя Лучшая Жизнь ждет тебя, иди к ней без страха!",
            "Каждый шаг приближает к Лучшей Жизни: не останавливайся!",
            "Успех начинается с малого, вперед к Лучшей Жизни!",
            "Ты можешь все, что захочешь - иди к Лучшей Жизни!",
            "Верь в свои силы и двигайся к Лучшей Жизни!",
            "Твой путь к Лучшей Жизни только начинается - иди вперед!"
        };

        public static string[] USER_CONGRATILATORY_RESPONSES_ANSWER = new string[]
        {
            "Молодец! Так держать!",
            "Отличная работа! Продолжай в том же духе!",
            "Я горжусь за вас! Продолжайте смело идти вперед!",
            "Вау, вы великолепны! Ничего не бойтесь и идите к своим целям!",
            "Вы молодец! Уверен, что вы сможете достичь всего, чего захотите!",
            "Просто восхитительно! Путь к успеху только начинается, и вы уже на верном пути!",
            "Замечательно! Развивайтесь и совершенствуйтесь дальше!",
            "Это потрясающе! Ваши усилия приносят свои плоды!",
            "Я вижу, как вы растете и преодолеваете все трудности! Продолжайте так же!",
            "Вы просто волшебник! Верьте в себя и ничто не остановит Вас на пути к успеху!",
            "Поздравляю! Ваше стремление к лучшему всегда приводит к отличным результатам!",
            "Отлично! Не сдавайтесь и двигайтесь дальше, вы на верном пути!",
            "Удивительно! Ваше решимость преодолевает любые препятствия!",
            "Правильно, так держать! Ваши достижения восхищают!",
            "Уверен, что у вас все получится! Продолжайте смело шагать вперед!"
        };

        public const string SUGGEST_QUICK_REGISTRATION = "Предлагаю Вам пройти быструю регистрацию, чтобы пользоваться сервисом в полном объеме.\n";
        public const string AVAILABLE_ONLY_TO_AUTHORIZED_USERS = "Данная функция доступна, только авторизованным пользователям.\n\n";

        public const string DIALOG_DEFAULT_CASE_1 = "{0}, дальше общение, пока только в живом формате. Твой Персональный консультант уже в курсе, что хочешь с ним связаться.";

        public const string NOT_CHANGE_NEXT_STEP = "Следующий шаг, не был назначен!";

        public const string DIALOG_DAY_2_STEP_2 = "При вызове меню, у вас появится возможность изменить настройки пользователя, или посмотреть их.";
        public const string DIALOG_DAY_2_STEP_3 = "{0}, Надеюсь ты уже успел освоить новый пункт меню и нам пора двигаться дальше!\nТы готов?";

        public const string DIALOG_DAY_2_STEP_8 = "Теперь, твоя задача, при заполнении дневника, указывать количество белков, жиров и углеводов.\n\n" +
            "Это понадобится для анализа твоего питания.";

        public const string DIALOG_DAY_2_STEP_7_2 = "Попробуй поискать их в том блюде, что ты сегодня съел...\n\n" +
                        "И теперь в следующий раз, записывай их при заполнении дневника.";

        public const string DIALOG_DAY_2_STEP_7_1 = "Как успехи?\r\n\r\n" +
                        "Получается? Не переживай, если ты так и не понял, где взять эти цифры...\r\n\r\n" +
                        "Я сейчас расскажу тебе, где взять эти данные. Да и я уверен, что ты уже сам об этом знаешь, просто подзабыл. \r\n\r\n" +
                        "Так вот, напоминаю, что у каждого продукта, или даже блюда, есть своя пищевая ценность, рассчитанная на 100 грамм продукта. \r\n" +
                        "Представляешь, как здорово? Тебе даже считать ничего не надо. \r\n\r\n" +
                        "Но вот, чтобы твое сознание начало меняться, тебе придется поискать эти самые данные... а сколько же белка, жиров или углеводов, в том, чем ты питаешься.\r\n\r\n" +
                        "Благо в интернете полно данных в свободной форме на этот счет. \r\n" +
                        "Также, эти данные пишутся сейчас практически на каждом продукте на этикетке.";

        public const string DIALOG_DAY_2_STEP_5 = " Хорошо! \r\n\r\n" +
                        "Пусть первая половина дня, будет тестовой..\r\n\r\n" +
                        "Попробуй заполнять эти данные, так, как ты считаешь нужным ) \r\n" +
                        "А через некоторое время, я снова выйду на связь, и расскажу тебе, где же взять эти данные..\r\n\r\n" +
                        "Интересно?";

        public const string DIALOG_DAY_2_STEP_4 = "Как ты уже мог заметить, в дневнике есть такие поля, как белок, жиры и углеводы.\r\n" +
                        "И возможно, ты даже уже их пытался заполнить, или тебе стало интересно, как же их заполнять, откуда взять эти данные?\r\n" +
                        "А если ты вдруг еще не открывал дневник питания, то тогда зачем ты тут? Ты собираешься менять свою жизнь к Лучшему?";

        public const string DIALOG_DAY_2_STEP_6 = "Твоя задача сейчас, заключается в том, чтобы при заполнении дневника, заполнять и поля, белки, жиры и углеводы.";

        public const string WHAT_DOES_A_PERSON_CONSIST_OF = "Человек состоит на 80% из чего? Из воды ♒\n\n" +
                        "А если быть точнее - тело человека на 78% состоит из воды, а как раз таки мозг - еще более «водянистый» (вода составляет до 80 процентов его объема).\n\n" +
                        "Неудивительно, что потребление достаточного количества воды - одно из основных условий нормального функционирования мозга.";

        public const string VPO_PROGRAM_ZOOM = "Также, для участия в программе Вам может потребоваться установить приложение ZOOM, <b><u>сейчас это не обязательно</u></b>.\r\n\r\n" +
                        "Расписание мероприятий будет отправлено Вам в Telegram.\r\n\r\n" +
                        "Также Вам потребуются напольные весы, приобретите, они обязательно принесут Вам огромную пользу.\r\n\r\n" +
                        "Для того, чтобы наглядно видеть изменения, необходимо сделать фотографии “ДО” и “ПОСЛЕ”, " +
                        "которые необходимо будет отправить Вашему Персональному Консультанту.";

        public const string SECRET_PASHAL_1 = "Кстати, я обещал Вам интересный процесс трансформации... \r\n\r\n" +
                        "Так вот, маленький секрет, в дневник питания, можно не только текст писать, но и вставлять смайлики и эмодзи 😇 например такие 🍋🍬☕";

        public const string WHAT_IS_FOODDIARY_1 = "Все верно, я же еще не рассказал...\r\n\r\n" +
                        "Мы взяли все самое лучшее и воплотили в жизнь, для Вашей Комфортной трансформации жизни.\r\n\r\n" +
                        "Теперь у Вас есть прекрасная возможность, вести свой личный электронный дневник питания.\r\n\r\n" +
                        "Его можно вызвать из специального пункта <b>Меню</b> -> <b>Открыть меню</b> -> <b>Дневник питания</b>";
        public const string WHAT_IS_FOODDIARY_2 = "Далее открывается меню, заполнить дневник или прочитать.\r\n\r\n" +
                        "Вы можете вносить изменения в свой дневник, в любое время. \r\n\r\n" +
                        "В любой момент, вы можете посмотреть свой дневник, а чем же вы питаетесь.";
        public const string WHAT_IS_FOODDIARY_3 = "Продолжим 😉\n" +
                        "Вам необходимо будет заполнять дневник каждый день.\r\n\r\n" +
                        "Не забывайте записывать свой вес, так в дальнейшем, Вы сможете увидеть свои изменения " +
                        "и получить более точный анализ своих данных, и персональную консультацию от Вашего консультанта.\r\n\r\n" +
                        "Пока что, просто записываем, все что едите, так, как вам удобно.\r\n\r\n" +
                        "Также, для Вашего удобства, поля <b>дата</b> и <b>время</b> приема пищи, задаются автоматически, но Вы с легкостью можете их подправить.";

        public const string BUTTON_AUTH_DOWN = "⬇️ Кнопка предствиться ниже ⬇️:";

        public const string BORDER_FRUIT = "🍎🍐🍊🍋🍌🍇🍓🍅🥝🥥🍍🍒🫐🥑🥦🥬";

        public const string USER_INSTRUCTION = "Для участия в программе необходимо установить приложение <b>ZOOM</b>.\n" +
                                               "Расписание мероприятий будет отправлено Вам в Telegram.\n" +
                                               "Вам нужны будут напольные весы.\n" +
                                               "Фотографии <b><i>“ДО”</i></b> и <b><i>“ПОСЛЕ”</i></b> необходимо будет отправить помощнику.";

        public const string USER_BOOKSTART_SEND = "Вот ваш дневник питания на первые 3 дня.\n\n" +
           "Вам необходимо будет заполнять его <b>каждый день.</b>\n\n" +
           "Утром <b>натощак</b> записываем свой вес.\n\n" +
           "<b>Каждый прием пищи</b> записываем в отдельную графу";

        public const string USER_HOWTOFILLOUTAFOODDIARY = "Посмотрите видео-инструкцию, как заполнять дневник питания.";

        public const string THANKSTOUSER = "<i>Спасибо за то, что Доверяете нам.</i>";
        public const string YOUR_MESSAGE_HAS_BEEN_RECEIVED = "Ваше сообщение получено. Ожидайте ответа!";

        public const string HELP_MENU_BUTTON = "Вы можете использовать следующие команды:\n\n" +
                        "<b>/start</b> - Начать разговор\n" +
                        "<b>/menu</b> - Вызвать меню\n" +
                        "<b>/help</b> - Показать это справочное сообщение\n";


    }
}
